In [1]:
import pandas as pd
import numpy as np
from datetime import datetime
from dateutil.relativedelta import relativedelta

- 권 보성회 근무자 정보

In [60]:
info = [
    ["박건홍", "송파지역 풍남지부", "지부", "010-6435-8796"],
    ["정민서", "송파지역 풍납지부", "그룹장", "010-6449-7175"],
    ["김세완", "잠실지역 잠실지부", "지역", "010-3762-8715"],
    ["황희성", "잠실지역 잠실지부", "그룹장", "010-6489-1542"],
    ["조성혁", "거여지역 마천지부", "지부", "010-5695-1153"],
    ["박희석", "거여지역 거여지부", "지부", "010-6545-7387"],
    ["이노현", "거여지역 영풍지부", "지역", "010-2856-1655"],
    ["정원철", "송파지역 송파지부", "지부", "010-8207-2216"],
    ["김필립", "잠실지역 삼전지부", "지부", "010-7979-4546"],
    ["임준혁", "거여지역 영풍지부", "지구리더", "010-4059-9132"],
    ["이영훈", "거여지역 거여지부", "회원", "010-4828-9565"],
    ["노성민", "송파지역 송파지부", "지구리더", "010-3409-0503"],
    ["송지훈", "잠실지역 가락지부", "그룹장", "010-4430-1540"],
    ["이상필", "잠실지역 문정지부", "지부", "010-3967-0502"],
    ["이태규", "거여지역 영풍지부", "그룹장", "010-3552-3119"],
    ["이창호", "거여지역 거여지부", "권", "010-7223-5814"],
    ["장윤재", "송파지역 송파지부", "회원", "010-7682-8247"],
    ["박종규", "잠실지역 가락지부", "지부", "010-5062-3836"],
]
sorted(info)

[['김세완', '잠실지역 잠실지부', '지역', '010-3762-8715'],
 ['김필립', '잠실지역 삼전지부', '지부', '010-7979-4546'],
 ['노성민', '송파지역 송파지부', '지구리더', '010-3409-0503'],
 ['박건홍', '송파지역 풍남지부', '지부', '010-6435-8796'],
 ['박종규', '잠실지역 가락지부', '지부', '010-5062-3836'],
 ['박희석', '거여지역 거여지부', '지부', '010-6545-7387'],
 ['송지훈', '잠실지역 가락지부', '그룹장', '010-4430-1540'],
 ['이노현', '거여지역 영풍지부', '지역', '010-2856-1655'],
 ['이상필', '잠실지역 문정지부', '지부', '010-3967-0502'],
 ['이영훈', '거여지역 거여지부', '회원', '010-4828-9565'],
 ['이창호', '거여지역 거여지부', '권', '010-7223-5814'],
 ['이태규', '거여지역 영풍지부', '그룹장', '010-3552-3119'],
 ['임준혁', '거여지역 영풍지부', '지구리더', '010-4059-9132'],
 ['장윤재', '송파지역 송파지부', '회원', '010-7682-8247'],
 ['정민서', '송파지역 풍납지부', '그룹장', '010-6449-7175'],
 ['정원철', '송파지역 송파지부', '지부', '010-8207-2216'],
 ['조성혁', '거여지역 마천지부', '지부', '010-5695-1153'],
 ['황희성', '잠실지역 잠실지부', '그룹장', '010-6489-1542']]

- 이번 달 or 다음 달 말일 구하기

In [61]:
today = datetime.today()

## 다음달 말일 구하기
next_month_last = datetime(today.year, today.month + 2, 1) + relativedelta(seconds=-1)
last = next_month_last.strftime("%d")
print(last)

## 이번달 말일 구하기
# this_month_last = datetime(today.year, today.month + 1, 1) + relativedelta(seconds=-1)
# last = this_month_last.strftime("%d")
# print(last)

28

- 근무 날짜 구하기

In [78]:
work = []
days = []
for i in range(1, int(last)+1):
    date = datetime(today.year, today.month + 1, i)
    if date.weekday() in [0, 1, 5, 6]:
        work.append(date.weekday())
        days.append(date.strftime("%m/%d"))

print(work, days)

[5, 6, 0, 1, 5, 6, 0, 1, 5, 6, 0, 1, 5, 6, 0, 1] ['02/04', '02/05', '02/06', '02/07', '02/11', '02/12', '02/13', '02/14', '02/18', '02/19', '02/20', '02/21', '02/25', '02/26', '02/27', '02/28']

- 보성회 근무 매칭(랜덤)
    - 1명당 월 1~2회 근무

In [81]:
for i, j in zip(range(len(work)), days):
    print(i+1, j)

1 02/04
2 02/05
3 02/06
4 02/07
5 02/11
6 02/12
7 02/13
8 02/14
9 02/18
10 02/19
11 02/20
12 02/21
13 02/25
14 02/26
15 02/27
16 02/28

In [82]:
len(info)

18

In [32]:
import pandas as pd

data = pd.read_excel("./data/gyohak_numbers.xlsx")
data.head()

     STUDY_EXAM_NO  PASS_NO KOR_NM  PASS_NO.1
0  420220600100002    25025    김동섭      25025
1  420220600100001    25026    송세원      25026
2  420220600100006    25027    양현석      25027
3  420220600100004    25028    윤길환      25028
4  420220600100005    25029    한동신      25029

In [33]:
print(data.columns)
data = data.rename(columns={"PASS_NO.1":"PASS_NO_1"})
data.head()

Index(['STUDY_EXAM_NO', 'PASS_NO', 'KOR_NM', 'PASS_NO.1'], dtype='object')

     STUDY_EXAM_NO  PASS_NO KOR_NM  PASS_NO_1
0  420220600100002    25025    김동섭      25025
1  420220600100001    25026    송세원      25026
2  420220600100006    25027    양현석      25027
3  420220600100004    25028    윤길환      25028
4  420220600100005    25029    한동신      25029

In [34]:
wrong_numbers = data.query("PASS_NO != PASS_NO_1")
wrong_numbers

        STUDY_EXAM_NO  PASS_NO KOR_NM  PASS_NO_1
1818  420220603800035    26843    김수빈      23759
1819  420220603800070    26844    김광림      23760
1820  420220603800034    26845    심민기      23761
1821  420220603800075    26846    조윤진      23762
1822  420220603800040    26847    최지희      23763
...               ...      ...    ...        ...
6647  420220614800105    31672    방수현      27056
6648  420220614800032    31673    정유진      27057
6649  420220614800076    31674    최지은      27058
6650  420220614800049    31675    이규담      27059
6651  420220614800081    31676     이젠      27060

[4834 rows x 4 columns]

In [53]:
data.query("PASS_NO_1 == 25230")

        STUDY_EXAM_NO  PASS_NO KOR_NM  PASS_NO_1
205   420220614600026    25230    이강무      25230
3289  420220608100132    28314    남동완      25230
4821  420220611300053    29846    박무성      25230

In [51]:
wrong_numbers[wrong_numbers.duplicated(subset="PASS_NO_1")]

        STUDY_EXAM_NO  PASS_NO KOR_NM  PASS_NO_1
4821  420220611300053    29846    박무성      25230
4822  420220611300057    29847    정춘희      25231
4823  420220611300021    29848    김경희      25232
4824  420220611300063    29849    이지연      25233
4825  420220611300065    29850    박숙희      25234
...               ...      ...    ...        ...
6348  420220611800096    31373    박미경      26757
6349  420220611800013    31374    이미지      26758
6350  420220611800022    31375    정욱희      26759
6351  420220611800029    31376    이경희      26760
6352  420220611800070    31377    박민영      26761

[1532 rows x 4 columns]

In [54]:
wrong_numbers[wrong_numbers.duplicated(subset="PASS_NO")]

Empty DataFrame
Columns: [STUDY_EXAM_NO, PASS_NO, KOR_NM, PASS_NO_1]
Index: []

In [26]:
wrong_numbers.to_excel("data/gyohak_numbers_wrong.xlsx", index=False)